app/views/games/join.html.erb

<ul>
  <% @games = Game.all %>
---
SELECT "games".* FROM "games"