app/views/games/show.html.erb

SELECT "killrequests".* FROM "killrequests" WHERE "killrequests"."game_id" = ? AND "killrequests"."victim_id" = ? LIMIT ?  [["game_id", 49], ["victim_id", 1], ["LIMIT", 1]]
---

  <%- if Killrequest.find_by(game_id: @game[:id], victim_id: @player[:id]) %>