app/controllers/games_controller.rb

  def create
    @game = Game.new(game_params)
    @creator = Player.new(player_params)
    # check if the gameid is unique
    if Game.find_by game_code: @game[:game_code] then
      flash[:alert] = "Game Code Taken"
      render "games/new_game"
      return
    else
      @game.save!
      @creator.update(name: params[:player][:name], password: params[:player][:password], game_id: @game[:id])
      @game.update(game_code: params[:game][:game_code], creator_id: @creator[:id])
      @creator.save!
---
SELECT "games".* FROM "games" WHERE "games"."game_code" = ? LIMIT ?  [["game_code", "test"], ["LIMIT", 1]]
INSERT INTO "games" ("game_code", "is_active", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?)  [["game_code", "test"], ["is_active", 0], ["created_at", "2022-03-07 02:13:03.538162"], ["updated_at", "2022-03-07 02:13:03.538162"], ["creator_id", nil]]
INSERT INTO "games" ("game_code", "is_active", "created_at", "updated_at", "creator_id") VALUES (?, ?, ?, ?, ?)  [["game_code", "test"], ["is_active", 0], ["created_at", "2022-03-06 22:43:30.453320"], ["updated_at", "2022-03-06 22:43:30.453320"], ["creator_id", nil]]
INSERT INTO "players" ("game_id", "name", "password", "target", "dead", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["game_id", 40], ["name", "josh"], ["password", "[FILTERED]"], ["target", "none"], ["dead", 0], ["created_at", "2022-03-06 22:41:45.803861"], ["updated_at", "2022-03-06 22:41:45.803861"]]

  def delete
    @game = Game.find_by id: session[:current_game_id]
    @players = Player.where(game: @game)
    for player in @players
      player.delete
    end
    @game.delete
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 47]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 4]]
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 47]]

  def die
    @player = Player.find_by id: session[:current_player_id]
    @killrequest = Killrequest.find_by victim_id: @player[:id]
    @assassin = Player.find_by id: @killrequest[:assassin_id]
    # assign next target
    @assassin.update_attribute(:target, @player[:target])
    @killrequest.delete
    @player.delete
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "killrequests".* FROM "killrequests" WHERE "killrequests"."victim_id" = ? LIMIT ?  [["victim_id", 5], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "players" SET "target" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["target", "4"], ["updated_at", "2022-03-11 02:29:11.866549"], ["id", 4]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 3]]
DELETE FROM "killrequests" WHERE "killrequests"."id" = ?  [["id", 16]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 5]]

  def enter
    @game = Game.find_by game_code: params[:game_code]
    if @game.present? then
---
SELECT "games".* FROM "games" WHERE "games"."game_code" = ? LIMIT ?  [["game_code", "test"], ["LIMIT", 1]]
SELECT "games".* FROM "games"

  def join
    if session[:current_game_id] && session[:current_player_id] then
      @game = Game.find_by id: session[:current_game_id]
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]

  def kill
    @player = Player.find_by id: session[:current_player_id]
    @game = Game.find_by id: session[:current_game_id]
    @victim = Player.find_by id: @player[:target]
    @killrequest = Killrequest.new(game_id: @game[:id], assassin_id: @player[:id], victim_id: @victim[:id])
    if Killrequest.find_by assassin_id: @player[:id], victim_id: @victim[:id]
      flash[:alert] = "already requested ask your victim to accept"
      redirect_to "/games/#{@game[:id]}"
      return
    end
    @killrequest.save!
---
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "killrequests".* FROM "killrequests" WHERE "killrequests"."assassin_id" = ? AND "killrequests"."victim_id" = ? LIMIT ?  [["assassin_id", 4], ["victim_id", 5], ["LIMIT", 1]]
INSERT INTO "killrequests" ("assassin_id", "victim_id", "game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["assassin_id", 4], ["victim_id", 5], ["game_id", 47], ["created_at", "2022-03-11 02:28:35.076921"], ["updated_at", "2022-03-11 02:28:35.076921"]]

  def show
    @game = Game.find_by id: session[:current_game_id]
    @creator = Player.find_by id: @game[:creator_id]
    @player = Player.find_by id: session[:current_player_id]
    @target = Player.find_by id: @player[:target]
    @players = Player.where(game: @game)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 46], ["LIMIT", 1]]

  def signup
    @game = Game.find_by id: session[:current_game_id]
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]

  def start
    @game = Game.find_by id: session[:current_game_id]
    @players = Player.where(game: @game)
    @shuffle = @players.shuffle()
    i = 0
    for player in @shuffle do

      if @shuffle[i + 1] then
        player.update_attribute(:target, @shuffle[i + 1][:game_id] == session[:current_game_id] ? @shuffle[i + 1][:id] : @shuffle[0][:id])
      else
        player.update_attribute(:target, @shuffle[0][:id])
      end
      i += 1
    end
    @game.update_attribute(:is_active, true)
---
SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."game_id" = ?  [["game_id", 47]]
UPDATE "games" SET "is_active" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["is_active", 1], ["updated_at", "2022-03-09 02:47:04.267006"], ["id", 45]]
UPDATE "players" SET "target" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["target", "4"], ["updated_at", "2022-03-11 02:28:14.303382"], ["id", 5]]
UPDATE "games" SET "is_active" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["is_active", 1], ["updated_at", "2022-03-11 01:55:41.316478"], ["id", 46]]
UPDATE "players" SET "target" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["target", "5"], ["updated_at", "2022-03-11 02:28:14.316371"], ["id", 4]]
UPDATE "games" SET "is_active" = ?, "updated_at" = ? WHERE "games"."id" = ?  [["is_active", 1], ["updated_at", "2022-03-11 02:28:14.324135"], ["id", 47]]