app/controllers/games_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 42], ["LIMIT", 1]]
---
  def delete
    @game = Game.find_by id: session[:current_game_id]
    @players = Player.where(game: @game)

SELECT "killrequests".* FROM "killrequests" WHERE "killrequests"."assassin_id" = ? AND "killrequests"."victim_id" = ? LIMIT ?  [["assassin_id", 1], ["victim_id", 3], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def die
    @player = Player.find_by id: session[:current_player_id]
    @killrequest = Killrequest.find_by victim_id: @player[:id]
    @assassin = Player.find_by id: @killrequest[:assassin_id]