app/controllers/players_controller.rb

SELECT "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? AND "players"."game_id" = ? LIMIT ?  [["name", "reeeeee"], ["game_id", 4], ["LIMIT", 1]]
SELECT "players".* FROM "players" WHERE "players"."name" = ? AND "players"."game_id" = ? LIMIT ?  [["name", "josh"], ["game_id", 38], ["LIMIT", 1]]
INSERT INTO "players" ("game_id", "name", "password", "target", "dead", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["game_id", 42], ["name", "jo"], ["password", "[FILTERED]"], ["target", "none"], ["dead", 0], ["created_at", "2022-03-06 23:00:36.639391"], ["updated_at", "2022-03-06 23:00:36.639391"]]
---
  def create
    @game = Game.find_by id: session[:current_game_id]
    @player = Player.new(player_params.merge(game_id: session[:current_game_id]))
# check if the player already exists
    if Player.find_by name: @player[:name], game_id: session[:current_game_id]
# Validate Password if player exists
      @currentplayer = Player.find_by name: @player[:name], game_id: session[:current_game_id]
      if params[:player][:password] == @currentplayer[:password] then
        session[:current_player_id] = @currentplayer[:id]
        redirect_to "/games/#{@game[:id]}"
      else
        flash[:alert] = "Incorrect password / Name in use"
        redirect_to "games/signup"
      end
    elsif not @game[:is_active] then
#create a player if does not exist and game is inactive
      @player.save!